app/Http/routes.php

if (!\App::runningInConsole() ||
    !in_array((new \Symfony\Component\Console\Input\ArgvInput())->getFirstArgument(), $builtin_commands)) {
    // Global view options
    \View::share('email_templates', Models\EmailTemplate::all());
    \View::share('email_list_types', Services\Email::GetToListTypes());
    \View::share('loaded_batch', Models\Batch::Loaded());
    \View::share('all_batches', Models\Batch::orderBy('starts_at', 'ASC')->get());
    \View::share('all_regions', Models\Region::all());
    \View::share('all_applications', Models\Application::all());
---
select * from `email_templates`
select * from `batches` order by `starts_at` asc
select * from `regions` where `regions`.`deleted_at` is null
select * from `applications`