app/Http/Controllers/Api/ApiController.php

    protected function setApplicationOrFail()
    {
        if (!$this->application) {
            // TODO: deprecate all other forms of "public" and "private"
            $public = \Input::get('public') ? \Input::get('public') : \Input::get('token');
            if (!$public) {
                $public = \Input::get('access_token');
            }

            $private = \Input::get('private') ? \Input::get('private') : \Input::get('secret');

            $application = Models\Application::where('public', '=', $public)->first();
---
select * from `applications` where `public` = 'testtesttesttesttesttest' limit 1