app/Http/Controllers/Api/ImageController.php

    private function getClass()
    {
        $class = \Route::input('class');
        $id = \Route::input('id');

        switch ($class) {
            case "sponsor":
                return Models\Batch\Event\Sponsor::find($id);
            case "region":
                return Models\Region::find($id);
---
select * from `regions` where `regions`.`deleted_at` is null and `regions`.`id` = 'sf' limit 1