app/Http/Controllers/Api/Register.php

select * from `giftcards` where `code` = '' limit 1
---
    private function _postRegister()
    {
        $event = \Route::input('event');
        $registrants = $this->zipRegistrants(\Input::get('first_names'), \Input::get('last_names'), \Input::get('emails'));
        $count = count($registrants);

        $giftcard = Models\GiftCard::where('code', '=', strtoupper(\Input::get('code')))->first();
        $promotion = Models\Batch\Event\Promotion::where('code', '=', strtoupper(\Input::get('code')))
            ->where('batches_event_id', '=', $event->id)
            ->first();

        if (\Input::get('code') && !isset($giftcard) && !isset($promotion))