app/Http/Controllers/Api/Regions.php

    public function getIndex()
    {
        return json_encode(ModelContracts\Region::Collection(Models\Region::with('events')->get(), $this->permissions));
---
select * from `regions` where `regions`.`deleted_at` is null