app/Models/Batch/Event.php

    public function getPreviousEventAttribute()
    {

        return Models\Batch\Event
                ::select('batches_events.*')
                ->join('batches', 'batches_events.batch_id', '=', 'batches.id')
                ->where('batches.starts_at', '<', $this->batch->starts_at)
                ->where('batches_events.region_id', '=', $this->region_id)
                ->where('batches_events.allow_registrations', '=', true)
                ->orderBy('batches.starts_at', 'DESC')
                ->first();
---
select `batches_events`.* from `batches_events` inner join `batches` on `batches_events`.`batch_id` = `batches`.`id` where `batches_events`.`deleted_at` is null and `batches`.`starts_at` < '2018-02-17 00:00:00' and `batches_events`.`region_id` = 'sf' and `batches_events`.`allow_registrations` = '1' order by `batches`.`starts_at` desc limit 1