app/Http/Controllers/Manage/Tools/ApplicationsController.php

select * from `applications`
---
    public function getIndex()
    {
        \View::share('all_applications', Models\Application::all());