app/Http/filters/models.php

select * from `regions` where `regions`.`deleted_at` is null and `id` = 'sf' limit 1
---

use CodeDay\Clear\Models;

\Route::bind('region', function($val) {
    $region = Models\Region::where('id', '=', $val)->first();
    if ($region) {
        return $region;
    } else {
        // TODO(@tylermenezes): Support multiple loaded batches
        $event = Models\Batch::Loaded()->EventWithWebname($val);
        $region = $event->region;
        $region->_event_override = $event;
        return $region;
    }
});