app/Http/Controllers/Manage/Batch/ChangeController.php

select * from `batches` order by `starts_at` asc
---
    public function getIndex()
    {
        if (\Input::get('id')) {
            Models\Batch::find(\Input::get('id'))->manage();
            return \Redirect::to('/batch');
        } else {
            \View::share('all_batches', Models\Batch::orderBy('starts_at', 'ASC')->get());