app/Models/Ban.php

select * from `bans` where `email` = 'tylermenezes@gmail.com' and (`expires_at` > '2017-11-21 07:11:56' or `expires_at` is null) limit 1
---
    public static function GetBannedReasonOrNull($email)
    {
        if (!$email) return null;
        return self
            ::where('email', '=', trim($email))
            ->where(function ($query) {
                $query
                    ->where('expires_at', '>', Carbon::now()->format('Y-m-d H:i:s'))
                    ->orWhereNull('expires_at');
            })
            ->first();