app/Models/Batch.php

    public function EventWithWebname(string $webname) : Batch\Event
    {
        return Batch\Event
            ::where('batch_id', '=', $this->id)
            ->where(function($group) use ($webname) {
                return $group
                    ->where('webname_override', '=', $webname)
                    ->orWhere(function($w2) use ($webname) {
                        return $w2
                            ->where('region_id', '=', $webname)
                            ->whereNull('webname_override');
                    });
---
select * from `batches` where `batches`.`id` = 'OTG90cekwsNv' limit 1

    public static function Managed()
    {
        if (!isset(self::$_managed)) {
            if (!\Session::get('managed_batch_id')) {
                \Session::set('managed_batch_id', self::Loaded()->id);
            }

            $batch = self::where('id', '=', \Session::get('managed_batch_id'))->with('events')->first();
---
select * from `batches` where `batches`.`id` = 'OTG90cekwsNv' limit 1