app/Models/User.php

    public static function fromToken($token)
    {
        list($username, $signature) = explode('$', base64_decode($token));
        if (hash_hmac('sha256', $username, config('app.key')) == $signature) {
            return self::where('username', '=', $username)->first();
---
select * from `users` where `users`.`username` = 'tylermenezes' limit 1

    public static function fromS5Username($username)
    {
        $user = self::find($username);
---
select * from `users` where `users`.`username` = 'tylermenezes' limit 1

    public function getManagedEvents(Batch $batch)
    {
        return Batch\Event::select('batches_events.*')
                        ->where('batch_id', '=', $batch->id)
                        ->join('users_grants', 'users_grants.batches_event_id', '=', 'batches_events.id', 'left')
                        ->where(function($query) {
                            $query->where('users_grants.username', '=', $this->username)
                                ->orWhere('batches_events.manager_username', '=', $this->username)
                                ->orWhere('batches_events.evangelist_username', '=', $this->username)
                                ->orWhere('batches_events.coach_username', '=', $this->username);
                        })
                        ->groupBy('batches_events.id')
                        ->get();
---
select `batches_events`.* from `batches_events` left join `users_grants` on `users_grants`.`batches_event_id` = `batches_events`.`id` where `batches_events`.`deleted_at` is null and `batch_id` = 'OTG90cekwsNv' and (`users_grants`.`username` = 'tylermenezes' or `batches_events`.`manager_username` = 'tylermenezes' or `batches_events`.`evangelist_username` = 'tylermenezes' or `batches_events`.`coach_username` = 'tylermenezes') group by `batches_events`.`id`